import slide1 from "../../assets/main/hero/hero1.svg";
import slide2 from "../../assets/main/hero/hero2.svg";
import slide3 from "../../assets/main/hero/hero3.svg";

export const dataDesc = [
  {
    img: slide1,
    title: "Школа ходи",
    description:
      "Наша Школа ходи для ветеранів - це не просто набір екстремальних пригод. Це потужний інструмент для відновлення та підвищення якості життя.",
  },
  {
    img: slide2,
    title: "Місія",
    description:
      "Наша Школа ходи для ветеранів - це не просто набір екстремальних пригод. Це потужний інструмент для відновлення та підвищення якості життя.",
  },
  {
    img: slide3,
    title: "Школа ходи",
    description:
      "Наша Школа ходи для ветеранів - це не просто набір екстремальних пригод. Це потужний інструмент для відновлення та підвищення якості життя.",
  },
];
