import * as Yup from "yup";

export const validationSchema = Yup.object({
  username: Yup.string()
    .matches(/^[a-zA-Zа-яА-Я]+$/, "Невірне ім’я")
    .min(2, "Ім’я повинно бути не менше 2 знаків")
    .max(30, "Ім’я повинно бути не більше 30 знаків")
    .required("Введіть ім’я"),
  surname: Yup.string()
    .matches(/^[a-zA-Zа-яА-Я]+$/, "Невірне прізвище")
    .min(2, "Прізвище повинно бути не менше 2 знаків")
    .max(30, "Прізвище повинно бути не більше 30 знаків")
    .required("Введіть своє прізвище"),
  email: Yup.string()
    .matches(
      /^[a-zA-Z0-9._-]+@([a-zA-Z]+[-])*[a-zA-Z]+(\.[a-zA-Z]{2,4})+$/,
      "Невірна електронна пошта",
    )
    .required("Введіть електронну пошту"),
  phoneNumber: Yup.string()
    .matches(/^[\d\s+]+$/, "Невірний формат номера телефону")
    .min(2, "Невірна довжина телефону")
    .max(19, "Телефон повинен бути не більше 19 знаків"),
  message: Yup.string()
    .matches(/.*\S+.*/, "Повідомлення не може бути лише пробілами")
    .max(300, "Повідомлення повинно бути не більше 300 знаків"),
});
