import * as Yup from "yup";

export const validationSchema = Yup.object({
  name: Yup.string()
    .matches(/^\p{L}*(-\p{L}+)*$/u, "Тількі літери")
    .min(2, "Ім’я повинно бути не менше 2 знаків")
    .max(30, "Ім’я повинно бути не більше 30 знаків")
    .required("Введіть ім’я"),
  surname: Yup.string()
    .matches(/^\p{L}*(-\p{L}+)*$/u, "Тількі літери")
    .min(2, "Прізвище повинно бути не менше 2 знаків")
    .max(50, "Прізвище повинно бути не більше 50 знаків")
    .required("Введіть своє прізвище"),
  email: Yup.string()
    .matches(
      /^[a-zA-Z0-9._-]+@([a-zA-Z]+[-])*[a-zA-Z]+(\.[a-zA-Z]{2,4})+$/,
      "Невірна електронна пошта",
    )
    .test("domain", "Домени .ru та .by не підтримуються", (value) => {
      return !value?.endsWith(".ru") && !value?.endsWith(".by");
    })
    .required("Введіть електронну пошту"),
  phone: Yup.string()
    .max(16, "Невірний формат телефону. Правильний формат: +380 ## ### ####")
    .matches(
      /^\+380 \d{2} \d{3} \d{4}$/,
      "Невірний формат номеру. Приклад: +380 ## ### ####",
    ),
  text: Yup.string()
    .matches(/.*\S+.*/, "Введіть ваше повідомлення")
    .min(10, "Повідомлення повинно бути не менше 10 знаків")
    .max(300, "Повідомлення повинно бути не більше 300 знаків")
    .required("Введіть ваше повідомлення"),
});
